espruino/Espruino/targets/stm32/jshardware.c
  return false;

/*#ifdef ESPRUINOBOARD
  // recover...
  RCC_HSEConfig ( RCC_HSE_ON ) ;
  while(RCC_GetFlagStatus(RCC_FLAG_HSERDY) == RESET);
  RCC_PLLCmd ( ENABLE ) ;
  while ( RCC_GetFlagStatus ( RCC_FLAG_PLLRDY ) == RESET ) ;
  RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
  while(RCC_GetSYSCLKSource() != 0x08);
  RCC_HSICmd(DISABLE);
  // re-initialise peripherals
  SystemCoreClockUpdate();
  jshUSARTInitInfo(&inf);
  jshUSARTSetup(DEFAULT_CONSOLE_DEVICE, &inf);
#endif*/
}

typedef enum {
  UT_NONE,
  UT_PIN_SET_RELOAD_EVENT,
  UT_PIN_SET,
} PACKED_FLAGS UtilTimerType;

typedef enum {
  UET_SET, ///< Set a pin to a value
  UET_WRITE_BYTE, ///< Write a byte to an address
} PACKED_FLAGS UtilTimerEventType;

#define UTILTIMERTASK_PIN_COUNT (4)

typedef struct UtilTimerTaskSet {
  Pin pins[UTILTIMERTASK_PIN_COUNT]; ///< pins to set
  uint8_t value; ///< value to set pins to
} PACKED_FLAGS UtilTimerTaskSet;


typedef struct UtilTimerTaskWrite {
  void *addr; ///< Address to write to (some peripheral?)
  JsVar *var; ///< variable to get data from
  unsigned char charIdx; ///< Index of character in variable
} PACKED_FLAGS UtilTimerTaskWrite;

typedef union UtilTimerTaskData {
  UtilTimerTaskSet set;
  UtilTimerTaskWrite write;
} UtilTimerTaskData;

typedef struct UtilTimerTask {
  JsSysTime time; // time at which to set pins
  unsigned int repeatInterval; // if nonzero, repeat the timer
  UtilTimerEventType type;
  UtilTimerTaskData data; // data used when timer is hit
} PACKED_FLAGS UtilTimerTask;

#define UTILTIMERTASK_TASKS (16) // MUST BE POWER OF 2
UtilTimerTask utilTimerTasks[UTILTIMERTASK_TASKS];
volatile unsigned char utilTimerTasksHead = 0;
volatile unsigned char utilTimerTasksTail = 0;


volatile UtilTimerType utilTimerType = UT_NONE;
unsigned int utilTimerBit;
bool utilTimerState;
unsigned int utilTimerData;
uint16_t utilTimerReload0H, utilTimerReload0L, utilTimerReload1H, utilTimerReload1L;
Pin utilTimerPin;

void _utilTimerDisable() {
  utilTimerType = UT_NONE;
  TIM_Cmd(UTIL_TIMER, DISABLE);
}

void _utilTimerEnable(uint16_t prescale, uint16_t initialPeriod) {
  if (utilTimerType != UT_PIN_SET) {
    jshSetPinStateIsManual(utilTimerPin, false);
    jshPinSetState(utilTimerPin, JSHPINSTATE_GPIO_OUT);
  }

  /* TIM6 Periph clock enable */
  RCC_APB1PeriphClockCmd(UTIL_TIMER_APB1, ENABLE);


  /*Timer configuration------------------------------------------------*/
  TIM_ITConfig(UTIL_TIMER, TIM_IT_Update, DISABLE);
  TIM_Cmd(UTIL_TIMER, DISABLE);
 // TIM_ARRPreloadConfig(UTIL_TIMER, FALSE); // disable auto buffering 'period' register
// TIM_UpdateRequestConfig(UTIL_TIMER, TIM_UpdateSource_Regular); // JUST underflow/overflow

  TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
  TIM_TimeBaseStructInit(&TIM_TimeBaseInitStruct);
  TIM_TimeBaseInitStruct.TIM_Prescaler = prescale;
  TIM_TimeBaseInitStruct.TIM_Period = initialPeriod;
  TIM_TimeBaseInit(UTIL_TIMER, &TIM_TimeBaseInitStruct);

  //TIM_ClearITPendingBit(UTIL_TIMER, TIM_IT_Update);
  TIM_ITConfig(UTIL_TIMER, TIM_IT_Update, ENABLE);
  TIM_Cmd(UTIL_TIMER, ENABLE);  /* enable counter */
}

void _utilTimerSetPinStateAndReload() {
  if (utilTimerType == UT_PIN_SET_RELOAD_EVENT) {
    // in order to set this timer, we must have set the arr register, fired the timer irq, and then waited for the next!
    utilTimerType = UT_PIN_SET;
  } else if (utilTimerType == UT_PIN_SET) {
    JsSysTime time = jshGetSystemTime();
    // execute any timers that are due
    while (utilTimerTasksTail!=utilTimerTasksHead && utilTimerTasks[utilTimerTasksTail].time<time) {
      UtilTimerTask *task = &utilTimerTasks[utilTimerTasksTail];
      // actually perform the task
      switch (task->type) {
        case UET_SET: {
          int j;
          for (j=0;j<UTILTIMERTASK_PIN_COUNT;j++) {
            if (task->data.set.pins[j] == PIN_UNDEFINED) break;
            jshPinSetValue(task->data.set.pins[j], (task->data.set.value >> j)&1);
          }
        } break;
        case UET_WRITE_BYTE: {
          // write data into var
          *((unsigned int*)task->data.write.addr) = (unsigned int)(unsigned char)task->data.write.var->varData.str[task->data.write.charIdx];
          // move to next element in var
          task->data.write.charIdx++;
          unsigned char maxChars = (unsigned char)jsvGetCharactersInVar(task->data.write.var);
          if (task->data.write.charIdx >= maxChars) {
            task->data.write.charIdx = (unsigned char)(task->data.write.charIdx - maxChars);
            if (task->data.write.var->lastChild) {
              JsVar *next = jsvLock(task->data.write.var->lastChild);
              jsvUnLock(task->data.write.var);
              task->data.write.var = next;
            } else {
              // No more data - make sure we don't repeat!
              task->repeatInterval = 0;
            }
          }
        } break;
        default: break;
      }
      // If we need to repeat
      if (task->repeatInterval) {
        // update time
        task->time += task->repeatInterval;
        // do an in-place bubble sort to ensure that times are still in the right order
        unsigned char ta = utilTimerTasksTail;
        unsigned char tb = (ta+1) & (UTILTIMERTASK_TASKS-1);
        while (tb != utilTimerTasksHead) {
          if (utilTimerTasks[ta].time > utilTimerTasks[tb].time) {
            UtilTimerTask task = utilTimerTasks[ta];
            utilTimerTasks[ta] = utilTimerTasks[tb];
            utilTimerTasks[tb] = task;
          }
          ta = tb;
          tb = (tb+1) & (UTILTIMERTASK_TASKS-1);
        }
      } else {
        // Otherwise no repeat - just go straight to the next one!
        utilTimerTasksTail = (utilTimerTasksTail+1) & (UTILTIMERTASK_TASKS-1);
      }
    }

    // re-schedule the timer if there is something left to do
    if (utilTimerTasksTail != utilTimerTasksHead) {
      utilTimerType = UT_PIN_SET_RELOAD_EVENT;
      unsigned int timerFreq = jshGetTimerFreq(UTIL_TIMER);
      int clockTicks = (int)(((JsVarFloat)timerFreq * (JsVarFloat)(utilTimerTasks[utilTimerTasksTail].time-time)) / getSystemTimerFreq());
      if (clockTicks<0) clockTicks=0;
      int prescale = clockTicks/65536; // ensure that maxTime isn't greater than the timer can count to
      if (prescale>65535) prescale=65535;
      int ticks = (uint16_t)(clockTicks/(prescale+1));
      if (ticks<1) ticks=1;
      if (ticks>65535) ticks=65535;
      TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
      TIM_TimeBaseStructInit(&TIM_TimeBaseInitStruct);
      TIM_TimeBaseInitStruct.TIM_Prescaler = (uint16_t)prescale;
      TIM_TimeBaseInitStruct.TIM_Period = (uint16_t)ticks;
      TIM_TimeBaseInit(UTIL_TIMER, &TIM_TimeBaseInitStruct);
    } else {
      _utilTimerDisable();
    }
  } else {
    // Nothing left to do - disable the timer
    _utilTimerDisable();
  }

