espruino/Espruino/targets/stm32/jshardware.c
}

/// Called when the timer is fired
void UTIL_TIMER_IRQHandler(void) {
  // clear interrupt flag
  if (TIM_GetITStatus(UTIL_TIMER, TIM_IT_Update) != RESET) {
    TIM_ClearITPendingBit(UTIL_TIMER, TIM_IT_Update);
    // handle
    _utilTimerSetPinStateAndReload();
  }
}

void _utilTimerWait() {
  WAIT_UNTIL(utilTimerType == UT_NONE, "Utility Timer");
}

/// Return the latest task for a pin (false if not found)
bool jshGetLastPinTimerTask(Pin pin, UtilTimerTask *task) {
  unsigned char ptr = utilTimerTasksHead;
  while (ptr != utilTimerTasksTail) {
    if (utilTimerTasks[ptr].type == UET_SET) {
      int i;
      for (i=0;i<UTILTIMERTASK_PIN_COUNT;i++)
        if (utilTimerTasks[ptr].data.set.pins[i] == pin) {
          *task = utilTimerTasks[ptr];
          return true;
        } else if (utilTimerTasks[ptr].data.set.pins[i]==PIN_UNDEFINED)
          break;
    }
    ptr = (ptr+UTILTIMERTASK_TASKS-1) & (UTILTIMERTASK_TASKS-1);
  }
  return false;
}

void jshPinPulse(Pin pin, bool pulsePolarity, JsVarFloat pulseTime) {
  // ---- USE TIMER FOR PULSE
  if (!jshIsPinValid(pin)) {
       jsError("Invalid pin!");
       return;
  }
  if (pulseTime<=0) {
    // just wait for everything to complete
    _utilTimerWait();
    return;
  } else {
    // find out if we already had a timer scheduled
    UtilTimerTask task;
    if (!jshGetLastPinTimerTask(pin, &task)) {
      // no timer - just start the pulse now!
      jshPinOutput(pin, pulsePolarity);
      task.time = jshGetSystemTime();
    }
    // Now set the end of the pulse to happen on a timer
    jshPinOutputAtTime(task.time + jshGetTimeFromMilliseconds(pulseTime), &pin, 1, !pulsePolarity);
  }
}

/// Is the timer full - can it accept any other signals?
bool utilTimerIsFull() {
  unsigned char nextHead = (utilTimerTasksHead+1) & (UTILTIMERTASK_TASKS-1);
  return nextHead == utilTimerTasksTail;
}

// Queue a task up to be executed when a timer fires... return false on failure
bool utilTimerInsertTask(UtilTimerTask *task) {
  // check if queue is full or not
  if (utilTimerIsFull()) return false;


  jshInterruptOff();

  // find out where to insert
  unsigned char insertPos = utilTimerTasksTail;
  while (insertPos != utilTimerTasksHead && utilTimerTasks[insertPos].time < task->time)
    insertPos = (insertPos+1) & (UTILTIMERTASK_TASKS-1);

  bool haveChangedTimer = insertPos==utilTimerTasksTail;
  //jsiConsolePrint("Insert at ");jsiConsolePrintInt(insertPos);jsiConsolePrint(", Tail is ");jsiConsolePrintInt(utilTimerTasksTail);jsiConsolePrint("\n");
  // shift items forward
  int i = utilTimerTasksHead;
  while (i != insertPos) {
    unsigned char next = (i+UTILTIMERTASK_TASKS-1) & (UTILTIMERTASK_TASKS-1);
    utilTimerTasks[i] = utilTimerTasks[next];
    i = next;
  }
  // add new item
  utilTimerTasks[insertPos] = *task;
  // increase task list size
  utilTimerTasksHead = (utilTimerTasksHead+1) & (UTILTIMERTASK_TASKS-1);

  //jsiConsolePrint("Head is ");jsiConsolePrintInt(utilTimerTasksHead);jsiConsolePrint("\n");
  // now set up timer if not already set up...
  if (utilTimerType != UT_PIN_SET || haveChangedTimer) {
    //jsiConsolePrint("Starting\n");
    unsigned int timerFreq = jshGetTimerFreq(UTIL_TIMER);
    int clockTicks = (int)(((JsVarFloat)timerFreq * (JsVarFloat)(utilTimerTasks[utilTimerTasksTail].time-jshGetSystemTime())) / getSystemTimerFreq());
    if (clockTicks<0) clockTicks=0;
    int prescale = clockTicks/65536; // ensure that maxTime isn't greater than the timer can count to
    int ticks = (uint16_t)(clockTicks/(prescale+1));
    if (ticks<1) ticks=1;
    if (ticks>65535) ticks=65535;
    utilTimerType = UT_PIN_SET_RELOAD_EVENT;
    _utilTimerEnable((uint16_t)prescale, (uint16_t)ticks);
    //jsiConsolePrintInt(utilTimerType);jsiConsolePrint("\n");
  }

  jshInterruptOn();
  return true;
}

bool jshPinOutputAtTime(JsSysTime time, Pin *pins, int pinCount, uint8_t value) {
  assert(pinCount<UTILTIMERTASK_PIN_COUNT);
  UtilTimerTask task;
  task.time = time;
  task.repeatInterval = 0;
  task.type = UET_SET;
  int i;
  for (i=0;i<UTILTIMERTASK_PIN_COUNT;i++)
    task.data.set.pins[i] = (Pin)((i<pinCount) ? pins[i] : PIN_UNDEFINED);
  task.data.set.value = value?0xFF:0;

  WAIT_UNTIL(!utilTimerIsFull(), "Utility Timer");
  return utilTimerInsertTask(&task);
}

#define DHR12R1_OFFSET             ((uint32_t)0x00000008)
#define DAC_Align_8b_R                     ((uint32_t)0x00000008)

bool jshSignalWrite(JsSysTime period, Pin pin, JsVar *data) {
  UtilTimerTask task;
  task.repeatInterval = (unsigned int)period;
  task.time = jshGetSystemTime() + period;
  task.type = UET_WRITE_BYTE;
  task.data.write.addr = (void*)(DAC_BASE + DHR12R1_OFFSET + DAC_Align_8b_R);
  task.data.write.charIdx = 0;
  task.data.write.var = jsvLockAgain(data);
  return utilTimerInsertTask(&task);
}
